In [1]:
# Ref https://mubaris.com/2017/09/25/python-data-analysis-with-pandas/

In [12]:
# checking version

In [4]:
import pandas as pd

In [5]:
pd.__version__

'0.23.3'

In [7]:
! pip install pandas -U

Collecting pandas
  Using cached https://files.pythonhosted.org/packages/5d/d4/6e9c56a561f1d27407bf29318ca43f36ccaa289271b805a30034eb3a8ec4/pandas-0.23.4-cp35-cp35m-manylinux1_x86_64.whl
Requirement already satisfied, skipping upgrade: python-dateutil>=2.5.0 in ./lib/python3.5/site-packages (from pandas) (2.7.3)
Requirement already satisfied, skipping upgrade: pytz>=2011k in ./lib/python3.5/site-packages (from pandas) (2018.5)
Requirement already satisfied, skipping upgrade: numpy>=1.9.0 in ./lib/python3.5/site-packages (from pandas) (1.14.5)
Requirement already satisfied, skipping upgrade: six>=1.5 in ./lib/python3.5/site-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)
Installing collected packages: pandas
  Found existing installation: pandas 0.23.3
    Uninstalling pandas-0.23.3:
      Successfully uninstalled pandas-0.23.3
Successfully installed pandas-0.23.4

In [8]:
pd.__version__

'0.23.3'

In [9]:
import pandas as pd

In [11]:
pd.__version__ #we need to start a new ipynb window to use the last version pandas that we have upgraded

'0.23.3'

### pandas series

In [13]:
# pandas series can be used to 1D labeled array

In [14]:
index_list = ['UNSCH', 'UNI', 'UNALM', 'UNMSM', 'UNSAC']

In [15]:
index_list

['UNSCH', 'UNI', 'UNALM', 'UNMSM', 'UNSAC']

In [16]:
type(index_list)

list

In [17]:
len(index_list)

5

In [18]:
a = pd.Series([1500, 1950, 1900, 1400, 1600 ], index=index_list)

In [19]:
a

UNSCH    1500
UNI      1950
UNALM    1900
UNMSM    1400
UNSAC    1600
dtype: int64

In [20]:
a.index

Index(['UNSCH', 'UNI', 'UNALM', 'UNMSM', 'UNSAC'], dtype='object')

In [21]:
a[3]

1400

In [22]:
a['UNI']

1950

In [23]:
a * 3

UNSCH    4500
UNI      5850
UNALM    5700
UNMSM    4200
UNSAC    4800
dtype: int64

In [24]:
# you can even create a series of heterogeneous data

In [25]:
s = pd.Series(['random', 1.5, 'data'], index=['gauss', 1, '0.001'])

In [26]:
s

gauss    random
1           1.5
0.001      data
dtype: object

### now, the famous DataFrame

In [27]:
# pandas dataframe is a 2D labeled data structure, there are many methods to create them...

In [28]:
index_list = ['ayacucho','arequipa','lima','huanuco']

In [29]:
u = {
    'population': pd.Series([200, 900, 10000, 100], index=index_list),
    'mamsl': pd.Series([2700, 2700, 100, 2000], index=index_list)
}

In [30]:
index_list

['ayacucho', 'arequipa', 'lima', 'huanuco']

In [31]:
u

{'mamsl': ayacucho    2700
 arequipa    2700
 lima         100
 huanuco     2000
 dtype: int64, 'population': ayacucho      200
 arequipa      900
 lima        10000
 huanuco       100
 dtype: int64}

In [32]:
df = pd.DataFrame(u)

In [33]:
df

          mamsl  population
ayacucho   2700         200
arequipa   2700         900
lima        100       10000
huanuco    2000         100

In [34]:
df.index

Index(['ayacucho', 'arequipa', 'lima', 'huanuco'], dtype='object')

In [35]:
df.columns

Index(['mamsl', 'population'], dtype='object')

In [36]:
# creating dataframe from list of dictionaries

In [37]:
l = [{'orange':32, 'apple':42}, {'banana':25, 'carrot':44, 'apple':34}]

In [38]:
l

[{'apple': 42, 'orange': 32}, {'apple': 34, 'banana': 25, 'carrot': 44}]

In [39]:
l[0]

{'apple': 42, 'orange': 32}

In [40]:
l[0]['apple']

42

In [41]:
df = pd.DataFrame(l, index=['v1','v2'])

In [42]:
df

    apple  banana  carrot  orange
v1     42     NaN     NaN    32.0
v2     34    25.0    44.0     NaN

In [43]:
# you should notice that we got a dataframe with NaN values in it... why?

### creating a dataframe from text/csv files

In [44]:
# first, we get the file
! wget https://perso.telecom-paristech.fr/eagan/class/igr204/data/happiness.csv

--2018-08-23 10:41:03--  https://perso.telecom-paristech.fr/eagan/class/igr204/data/happiness.csv
Resolving perso.telecom-paristech.fr (perso.telecom-paristech.fr)... 137.194.2.165, 2001:660:330f:2::a5
Connecting to perso.telecom-paristech.fr (perso.telecom-paristech.fr)|137.194.2.165|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 1755 (1,7K) [text/csv]
Saving to: ‘happiness.csv’

happiness.csv       100%[===================>]   1,71K  --.-KB/s    in 0s

2018-08-23 10:41:04 (118 MB/s) - ‘happiness.csv’ saved [1755/1755]

In [45]:
! ls -all | grep 'csv'

-rw-rw-r--  1 ivan ivan   1755 awr 20 03:54 happiness.csv
-rw-rw-r--  1 ivan ivan  23278 jul 20 18:13 pima-indians-diabetes.data.csv

In [46]:
! cat happiness.csv | tail -5

In [47]:
! cat happiness.csv | head -5

In [48]:
df = pd.read_csv('happiness.csv')

In [49]:
df.head(5)

  Country  Gender  Mean    N=
0      AT    Male   7.3   471
1     NaN  Female   7.3   570
2     NaN    Both   7.3  1041
3      BE    Male   7.8   468
4     NaN  Female   7.8   542

In [50]:
df.shape

(105, 4)

### operations on dataframe

In [52]:
# recall what we made earlier

In [53]:
index_list = ['mit', 'stanford', 'harvard', 'caltech', 'cambridge']

In [54]:
u = { 
    'citations': pd.Series([99.9, 99.4, 99.9, 100, 78.4], index=index_list),
    'employer':pd.Series([100, 100, 100, 85.4, 100], index=index_list)
}

In [55]:
index_list

['mit', 'stanford', 'harvard', 'caltech', 'cambridge']

In [56]:
u

{'citations': mit           99.9
 stanford      99.4
 harvard       99.9
 caltech      100.0
 cambridge     78.4
 dtype: float64, 'employer': mit          100.0
 stanford     100.0
 harvard      100.0
 caltech       85.4
 cambridge    100.0
 dtype: float64}

In [57]:
type(index_list), type(u)

(list, dict)

In [58]:
df = pd.DataFrame(u)

In [59]:
df

           citations  employer
mit             99.9     100.0
stanford        99.4     100.0
harvard         99.9     100.0
caltech        100.0      85.4
cambridge       78.4     100.0

In [60]:
# creating a new row from current columns

In [61]:
df['score'] = (2 * df['citations'] + 3 * df['employer'])/5

In [62]:
df

           citations  employer  score
mit             99.9     100.0  99.96
stanford        99.4     100.0  99.76
harvard         99.9     100.0  99.96
caltech        100.0      85.4  91.24
cambridge       78.4     100.0  91.36

In [63]:
# we can create new column using boolean

In [64]:
df['flag'] = df['citations'] > 99.5

In [65]:
df

           citations  employer  score   flag
mit             99.9     100.0  99.96   True
stanford        99.4     100.0  99.76  False
harvard         99.9     100.0  99.96   True
caltech        100.0      85.4  91.24   True
cambridge       78.4     100.0  91.36  False

In [66]:
# we can remove columns too

In [67]:
df.pop('score')

mit          99.96
stanford     99.76
harvard      99.96
caltech      91.24
cambridge    91.36
Name: score, dtype: float64

In [68]:
df

           citations  employer   flag
mit             99.9     100.0   True
stanford        99.4     100.0  False
harvard         99.9     100.0   True
caltech        100.0      85.4   True
cambridge       78.4     100.0  False

### descriptive statistics using pandas

In [71]:
! wget https://raw.github.com/vincentarelbundock/Rdatasets/master/csv/DAAG/biomass.csv

--2018-08-23 12:11:54--  https://raw.github.com/vincentarelbundock/Rdatasets/master/csv/DAAG/biomass.csv
Resolving raw.github.com (raw.github.com)... 151.101.24.133
Connecting to raw.github.com (raw.github.com)|151.101.24.133|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/DAAG/biomass.csv [following]
--2018-08-23 12:11:54--  https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/DAAG/biomass.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.24.133
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.24.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 6677 (6,5K) [text/plain]
Saving to: ‘biomass.csv’

biomass.csv         100%[===================>]   6,52K  --.-KB/s    in 0s

2018-08-23 12:11:55 (13,9 MB/s) - ‘biomass.csv’ saved [6677/6677]

In [72]:
! ls -all | grep 'csv'

-rw-rw-r--  1 ivan ivan   6677 awu 23 12:11 biomass.csv
-rw-rw-r--  1 ivan ivan   1755 awr 20 03:54 happiness.csv
-rw-rw-r--  1 ivan ivan  23278 jul 20 18:13 pima-indians-diabetes.data.csv

In [73]:
! cat biomass.csv | head -5

"","dbh","wood","bark","root","rootsk","branch","species","fac26"
"1",90,5528,NA,460,NA,NA,"E. maculata","z"
"2",106,13650,NA,1500,665,NA,"E. pilularis","2"
"3",112,11200,NA,1100,680,NA,"E. pilularis","2"
"4",34,1000,NA,430,40,NA,"E. pilularis","2"

In [74]:
df = pd.read_csv('biomass.csv')

In [75]:
df.head(5)

   Unnamed: 0  dbh     wood  bark    root  rootsk  branch       species fac26
0           1   90   5528.0   NaN   460.0     NaN     NaN   E. maculata     z
1           2  106  13650.0   NaN  1500.0   665.0     NaN  E. pilularis     2
2           3  112  11200.0   NaN  1100.0   680.0     NaN  E. pilularis     2
3           4   34   1000.0   NaN   430.0    40.0     NaN  E. pilularis     2
4           5  130      NaN   NaN  3000.0  1030.0     NaN   E. maculata     z

In [76]:
# we are not interested in unnamed column so we will delete it

In [77]:
del df['Unnamed: 0']

In [78]:
df.head(5)

   dbh     wood  bark    root  rootsk  branch       species fac26
0   90   5528.0   NaN   460.0     NaN     NaN   E. maculata     z
1  106  13650.0   NaN  1500.0   665.0     NaN  E. pilularis     2
2  112  11200.0   NaN  1100.0   680.0     NaN  E. pilularis     2
3   34   1000.0   NaN   430.0    40.0     NaN  E. pilularis     2
4  130      NaN   NaN  3000.0  1030.0     NaN   E. maculata     z

In [79]:
df.describe()

,dbh,wood,bark,root,rootsk,branch
count,153.000000,133.000000,17.000000,54.000000,53.000000,76.000000
mean,26.352941,1569.045113,513.235294,334.383333,113.802264,54.065789
std,28.273679,4071.380720,632.467542,654.641245,247.224118,65.606369
min,3.000000,3.000000,7.000000,0.300000,0.050000,4.000000
25%,8.000000,29.000000,59.000000,11.500000,2.000000,10.750000
50%,15.000000,162.000000,328.000000,41.000000,11.000000,35.000000
75%,36.000000,1000.000000,667.000000,235.000000,45.000000,77.750000
max,145.000000,25116.000000,1808.000000,3000.000000,1030.000000,371.000000

In [80]:
# using another statistics concepts

In [81]:
df.mean()

dbh         26.352941
wood      1569.045113
bark       513.235294
root       334.383333
rootsk     113.802264
branch      54.065789
dtype: float64

In [82]:
df.median()

dbh        15.0
wood      162.0
bark      328.0
root       41.0
rootsk     11.0
branch     35.0
dtype: float64

In [83]:
df.min()

dbh                      3
wood                     3
bark                     7
root                   0.3
rootsk                0.05
branch                   4
species    Acacia mabellae
dtype: object

In [84]:
# pairwise correlation

In [85]:
df.corr()

             dbh      wood      bark      root    rootsk    branch
dbh     1.000000  0.905175  0.965413  0.899301  0.934982  0.861660
wood    0.905175  1.000000  0.971700  0.988752  0.967082  0.821731
bark    0.965413  0.971700  1.000000  0.961038  0.971341  0.943383
root    0.899301  0.988752  0.961038  1.000000  0.936935  0.679760
rootsk  0.934982  0.967082  0.971341  0.936935  1.000000  0.621550
branch  0.861660  0.821731  0.943383  0.679760  0.621550  1.000000

### data cleaning

In [86]:
# finding null values 
df.isnull().any()

dbh        False
wood        True
bark        True
root        True
rootsk      True
branch      True
species    False
fac26       True
dtype: bool

In [87]:
#findind na values
df.isna().any()

dbh        False
wood        True
bark        True
root        True
rootsk      True
branch      True
species    False
fac26       True
dtype: bool

In [90]:
# removing na values
df.dropna() # but its like a view

     dbh   wood   bark  root  rootsk  branch        species fac26
123   27  550.0  105.0  44.0     9.0    59.0  B. myrtifolia     z
124   26  414.0   78.0  38.0    13.0    44.0  B. myrtifolia     z
125    9   42.0    8.0   5.0     1.3     7.0  B. myrtifolia     z
126   12   85.0   13.0  17.0     2.2    16.0  B. myrtifolia     z

In [91]:
df.head(10)

   dbh     wood  bark    root  rootsk  branch        species fac26
0   90   5528.0   NaN   460.0     NaN     NaN    E. maculata     z
1  106  13650.0   NaN  1500.0   665.0     NaN   E. pilularis     2
2  112  11200.0   NaN  1100.0   680.0     NaN   E. pilularis     2
3   34   1000.0   NaN   430.0    40.0     NaN   E. pilularis     2
4  130      NaN   NaN  3000.0  1030.0     NaN    E. maculata     z
5   86   7027.0   NaN   550.0   290.0    94.0  E. botryoides     z
6   39   1086.0   NaN   220.0    48.0     NaN    E. maculata     z
7   50      NaN   NaN   524.0    74.0     NaN   E. pilularis     2
8   30      NaN   NaN   150.0    27.0     NaN   E. pilularis     2
9   39      NaN   NaN   245.0    28.0     NaN   E. pilularis     2

In [92]:
# right way to drop na
df2 = df.dropna()

In [93]:
df2

     dbh   wood   bark  root  rootsk  branch        species fac26
123   27  550.0  105.0  44.0     9.0    59.0  B. myrtifolia     z
124   26  414.0   78.0  38.0    13.0    44.0  B. myrtifolia     z
125    9   42.0    8.0   5.0     1.3     7.0  B. myrtifolia     z
126   12   85.0   13.0  17.0     2.2    16.0  B. myrtifolia     z